#include <iostream>

using namespace std;
//---------------------Функции и Прототипы---------------------------------------

// y = ax2 + bx + c 
// y = dx + k

//ax2 + bx + c = dx + k
// ax2 + bx - dx + c - k = 0
// ax2 + x (b - d) + (c - k) = 0         // НАше уравнение ( приведенное )

// D = b2 - 4ac
// 
// D = (b - d)^ - 4 * a * (c - k)         // наш ДИСКРИМИНАНТ

//----------------------------------------------------------------

//Если D < 0, корней нет;

// ничего не считаем!!

//Если D = 0, есть ровно один корень;

// x = (-b + &D) / 2a

//Если D > 0, корней будет два.

// x1 = (-b + &D) / 2a

// x2 = (-b - &D) / 2a

//------------------------MAIN----------------------------------------------------
int main() {
	setlocale(LC_ALL, "RU");
	
	//-------------------------------САМА ПРОГА-------------------------------------

	int a, b, c, d, k;
	float  y1, y2, x1, x2, Ds;

	cout << "y = a*x^ + b * x + c   Введите значение переменных а, b, c :" << endl;
	cout << "a = ";
	cin >> a;
	cout << "b = ";
	cin >> b;
	cout << "c = ";
	cin >> c;

	cout << "y = d * x + k    Введите значение переменных d , k  :" << endl;
	cout << "d = ";
	cin >> d;
	cout << "k = ";
	cin >> k;

	//---------------------------------------------------------------------------------

	Ds = (b - d) * (b - d) - 4 * a * (c - k);     // Получили ДИСКРИМИНАНТ

	if (Ds < 0)
	{
		cout << "Две линии не имеют точек пересичения !" << endl << endl;
	}

	else if (Ds == 0)
	{
		
		x1 = ( -(b - d) + sqrt(Ds)) / 2 * a;
		y1 = d * x1 + k;

	cout << "Точка пересечения двух линий : [ " << x1 << ", " << y1 << " ]" << endl << endl;
	}

	else if (Ds > 0)
	{
		x1 = (-(b - d) + sqrt(Ds)) / 2 * a;
		y1 = d * x1 + k;

		x2 = (-(b - d) - sqrt(Ds)) / 2 * a;
		y2 = d * x2 + k;

		cout << "Точки пересечения двух линий : [ " << x1 << ", " << y1 << " ] и [ " << x2 << ", " << y2 << " ]" << endl << endl;
	}

	system("pause");

	return 0;
}
